EDT/УТ/src/InformationRegisters/ИнформированиеЭкипажей/ИнформированиеЭкипажей.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ИнформированиеЭкипажей</name>
  <informationRegisterPeriodicity>Second</informationRegisterPeriodicity>
  <resources>
    <name>Статус</name>
    <type>
      <types>EnumRef.СтатусыВзаимодействия</types>
    </type>
  </resources>
  <resources>
    <name>ДатаСобытия</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </resources>
  <attributes>
    <name>Пользователь</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>ПереносРегламентом</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <dimensions>
    <name>Транспорт</name>
    <type>
      <types>CatalogRef.новаТранспорт</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

EDT/УТ/src/Enums/СтатусыВзаимодействия/СтатусыВзаимодействия.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>СтатусыВзаимодействия</name>
  <enumValues>
    <name>ОбъектПриглашен</name>
  </enumValues>
  <enumValues>
    <name>ВстречаПроизведена</name>
  </enumValues>
</mdclass:Enum>

EDT/УТ/src/CommonModules/ИнформированиеЭкипажейСервер/Module.bsl
Процедура РегламентПереносДатыИнформирования() Экспорт
	Зап = Новый Запрос;
	Зап.Текст = "ВЫБРАТЬ
	            |	ИнформированиеЭкипажейСрезПоследних.Транспорт КАК Транспорт
	            |ИЗ
	            |	РегистрСведений.ИнформированиеЭкипажей.СрезПоследних КАК ИнформированиеЭкипажейСрезПоследних
	            |ГДЕ
	            |	ИнформированиеЭкипажейСрезПоследних.Статус = ЗНАЧЕНИЕ(Перечисление.СтатусыВзаимодействия.ОбъектПриглашен)
	            |	И ИнформированиеЭкипажейСрезПоследних.ДатаСобытия = &ДатаСобытия";
	Зап.УстановитьПараметр("ДатаСобытия", НачалоДня(ТекущаяДата()));
	
	Выб = Зап.Выполнить().Выбрать();
	
	Пока Выб.Следующий() Цикл
		ТекВр = ТекущаяДата();
		
		Наб = РегистрыСведений.ИнформированиеЭкипажей.СоздатьНаборЗаписей();
		Наб.Отбор.Период.Установить(ТекВр);
		Наб.Отбор.Транспорт.Установить(Выб.Транспорт);
		
		Нов = наб.Добавить();
		
		Нов.Период = ТекВр;
		Нов.ДатаСобытия = ПолучитьСледующуюБуднююДату(НачалоДня(ТекущаяДата()));
		Нов.ПереносРегламентом = Истина;
		Нов.Пользователь = ПараметрыСеанса.ТекущийПользователь;
		Нов.Статус = Перечисления.СтатусыВзаимодействия.ОбъектПриглашен;
		Нов.Транспорт = Выб.Транспорт;
		
		Наб.Записать();
	КонецЦикла;	
КонецПроцедуры	

Функция ПолучитьСледующуюБуднююДату(ДатаОтсчета) Экспорт
	ДН = ДеньНедели(ДатаОтсчета);
	Если ДН < 5 Тогда
		Возврат НачалоДня(ДатаОтсчета + 86400);
	Иначе
		КолДней = 8 - ДН;
		Возврат НачалоДня(ДатаОтсчета + КолДней*86400);
	КонецЕСли;	
КонецФункции

Функция Информирование_ПроверитьТекущийСтатус(Статус, Транспорт) Экспорт
	// Вставить содержимое обработчика.
	Зап = Новый Запрос;
	Зап.Текст = "ВЫБРАТЬ
	            |	ИнформированиеЭкипажейСрезПоследних.Период КАК Период
	            |ИЗ
	            |	РегистрСведений.ИнформированиеЭкипажей.СрезПоследних(
	            |			,
	            |			Транспорт = &ВыбТранспорт
	            |				И Статус = &ВыбСтатус) КАК ИнформированиеЭкипажейСрезПоследних";
	Зап.УстановитьПараметр("ВыбСтатус", Статус);
	Зап.УстановитьПараметр("ВыбТранспорт", Транспорт);
	
	Рез = Зап.Выполнить();
	Возврат Рез.Пустой();
		
КонецФункции


Процедура Информирование_УстановитьСтатус(Статус, Транспорт, ДатаСобытия) Экспорт
	// Вставить содержимое обработчика.
	
	Наб = РегистрыСведений.ИнформированиеЭкипажей.СоздатьНаборЗаписей();
	ТекПер = ТекущаяДата();
	
	Наб.Отбор.Период.Установить(ТекПер);
	Наб.Отбор.Транспорт.Установить(Транспорт);
	
	
	Нов = Наб.Добавить();
	Нов.Период = ТекПер;
	Нов.Транспорт = Транспорт;
	Нов.Статус = Статус;
	Нов.ДатаСобытия = ДатаСобытия;
	Нов.Пользователь = ПараметрыСеанса.ТекущийПользователь;
	
	Наб.Записать();
КонецПроцедуры
